
# 使用字符串的format()方法，对输出数据项进行格式化

x1, y1 = 1.2, 3.57
x2, y2 = 2.26, 8.7

# 输出1
print('{:-^40}'.format('输出1'))  # ｛:-^40｝控制输出数据格式：宽度占40列，居中对齐，空白处用-补齐
print('x1 = {}, y1 = {}'.format(x1, y1))
print('x2 = {}, y2 = {}'.format(x2, y2))

# 输出2
print('{:-^40}'.format('输出2'))   # ｛:-^40｝控制输出数据格式：宽度占40列，居中对齐，空白处用-补齐
print('x1 = {:.1f}, y2 = {:.1f}'.format(x1, y1))  # {:.1f}控制小数输出精度，保留1位小数
print('x2 = {:.1f}, y2 = {:.1f}'.format(x2, y2))

# 输出3
print('{:-^40}'.format('输出3'))  # {:-^40}控制输出格式：宽度占40列，居中对齐，空白处用-补齐
print('x1 = {:<15}, y1 = {:<15}'.format(x1, y1))  # {:<15}控制数据输出宽度占15列，左对齐，空白处默认补空格
print('x2 = {:<15}, y2 = {:<15}'.format(x2, y2))
